УправлениеПаркомАттракционов/src/Catalogs/паПользователи/паПользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>паПользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Enums/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПользователей</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОператорАттракционов</name>
  </enumValues>
</mdclass:Enum>

УправлениеПаркомАттракционов/src/Catalogs/паПользователи/Forms/ФормаЭлемента/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПользовательИБ = 
		ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);	
		
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	ПользовательИБ.АутентификацияСтандартная = ДоступРазрешен;
	ПользовательИБ.ПолноеИмя = Объект.Наименование;
	ПользовательИБ.Имя = Логин;
	
	Если ПарольУстановлен Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить();
	
	Если РольПользователя = Перечисления.РолиПользователей.Администратор Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.паПолныеПрава);
	ИначеЕсли РольПользователя = Перечисления.РолиПользователей.Кассир Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Кассир);
	ИначеЕсли РольПользователя = Перечисления.РолиПользователей.ОператорАттракционов Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОператорАттракционов);
	КонецЕсли;
	
	ПользовательИБ.Записать();
	
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПользовательИБ = 
		ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);	
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ДоступРазрешен = ПользовательИБ.АутентификацияСтандартная;
	Логин = ПользовательИБ.Имя;
	
	Если ЗначениеЗаполнено(ПользовательИБ.СохраняемоеЗначениеПароля) Тогда
		ПарольУстановлен = Истина;
		Пароль = "*****";
	КонецЕсли;
	
	ЭтоАдминистратор = Ложь;
	ЭтоКассир = Ложь;
	ЭтоОператорАттракционов = Ложь;
	
	Для каждого Роль Из ПользовательИБ.Роли Цикл
		Если Роль = Метаданные.Роли.паПолныеПрава Тогда
			ЭтоАдминистратор = Истина;
		ИначеЕсли Роль = Метаданные.Роли.Кассир Тогда
			ЭтоКассир = Истина;
		ИначеЕсли Роль = Метаданные.Роли.ОператорАттракционов Тогда
			ЭтоОператорАттракционов = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоАдминистратор Тогда
		РольПользователя = Перечисления.РолиПользователей.Администратор;
	ИначеЕсли ЭтоКассир Тогда
		РольПользователя = Перечисления.РолиПользователей.Кассир;
	ИначеЕсли ЭтоОператорАттракционов Тогда
		РольПользователя = Перечисления.РолиПользователей.ОператорАттракционов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Пароль = "*****";	
	Элементы.Пароль.РежимПароля = Истина;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементами(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПарольУстановлен = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступРазрешенПриИзменении(Элемент)
	
	УправлениеЭлементами(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьПароль(Команда)
	
	Пароль = СлучайныйПароль();
	Элементы.Пароль.РежимПароля = Ложь;
	ПарольУстановлен = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СлучайныйПароль()
	
	ГСП = Новый ГенераторСлучайныхПаролей();
	Возврат ГСП.СлучайныйПароль(8, Истина);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементами(Форма)
	
	УправлениеПользователюДоступно = Форма.ДоступРазрешен;
	Форма.Элементы.Логин.Доступность = УправлениеПользователюДоступно;
	Форма.Элементы.ГруппаПароль.Доступность = УправлениеПользователюДоступно;
	Форма.Элементы.РольПользователя.Доступность = УправлениеПользователюДоступно;
	
КонецПроцедуры

#КонецОбласти
